---
tags: [thesis, bachelor, bsc, uhh, wtm, computer science, reinforcement learning, inverse kinematics, comparison, nociception, punishment]
categories: 

thumbnail: 
file: 
bibtex: "/supervised-theses/2017-12-Reipschlager2017Can.bib"
slides: 
library: 
supplementary: 
code: 

supervisors: [
      {
        family: Navarro-Guerrero,
        given: Nicolás
      },
      {
        family: Weber,
        given: Cornelius
      },
    ]

examiners: [
      {
        family: Navarro-Guerrero,
        given: Nicolás
      },
      {
        family: Weber,
        given: Cornelius
      },
    ]

citation: {
		"id": "http://zotero.org/users/1197610/items/MAD9DV2Q",
		"type": "thesis",
		"title": "Can Robot Nociception Increase the Human-Likeness of Grasping Postures?",
		"publisher": "Universität Hamburg",
		"publisher-place": "Hamburg, Germany",
		"number-of-pages": "39",
		"genre": "BSc",
		"event-place": "Hamburg, Germany",
		"abstract": "Today a multitude of different humanoid robots exist, built within university projects or by companies. A commonly used technique to perform tasks with a robot is to train a neural network, which handles the robot's actuators to fulfill the task. However, in most cases, only the looks of the humanoid robot are human-like. During tasks robots have non-human-like postures and motions because the main focus is to fulfill the task in a fast and accurate way. Even if human-likeness is desired, there is no human-likeness evaluation tool, which is commonly used or accepted. This thesis compares the postures generated by different reinforcement learning conditions during a grasping task in regarded to human-likeness, to determine if a condition involving nociception is able to generate more human-like postures than other conditions. For the human-likeness evaluation of robot postures, an ergonomic assessment is used under the hypothesis that humans tend to have grasping postures, that are not painful and do not strain muscles or joints more than needed.",
		"author": [
			{
				"family": "Reipschläger",
				"given": "Tim"
			}
		],
		"issued": {
			"year": "2017",
			"month": "12",
		}
	}
---
