---
tags: [talk, invited talk, research]
categories: talk
author: "Nicolás Navarro-Guerrero"
rights: "Copyright (&copy;) 2013 Nicolás Navarro-Guerrero"
license: 

thumbnail: 
file: 
bibtex: 
slides: 
supplementary:
code:

citation: {
		"id": "Navarro-Guerrero2013Sensorimotor",
		"type": "speech",
		"title": "Sensorimotor Information for Concrete and Abstract Knowledge Representation",
		"publisher-place": "Osaka, Japan",
		"genre": "Invited Talk",
		"event": "Special Session: Training in Robotics for Development of Cognition (RobotDoC) at ICDL-EpiRob",
		"event-place": "Osaka, Japan",
		"abstract": "The dream of seamless interaction between humans and robots requires understanding of agent's biomechanics, motion control and cognitive (subcortical and cortical) processes. In this session we focus on the latter. We argue that sensorimotor information is important not only for motor control but also for internal regulation of states and for high-order cognitive processes. The first discussed experiment focuses on sensory percepts essential for agents' self-protection and adaptation. We use a minimal set of interoceptive signals, such as hunger and pain, to drive energy-seeking and other self-protective behaviours based on fear learning. Although many such behaviours are innate or hard-wired they are insufficient to cope with highly dynamic environments. We present how fear-based online learning enables robots to safely cope with domestic environments. The second experiment addresses the challenge of generating timely responses in dynamical and unconstrained environments, due to the delay produced bysensory information processing, decision-making and final action execution. We address the role of predictive circuits at the sensor information level and how these predictions are used to produce faster and smoother reactions. Finally, we discuss the role of sensorimotor representations in hierarchical knowledge building and grounding of abstract words. Specifically, we investigate how proprioceptive information such as pointing gesture aids numerical representation in early development stages and how spatial representation remains coupled to the learned numerical representation. We also show how sensorimotor skills and experience grounded in primitive actions, such as reaching and grasping, can be hierarchically subsumed, enabling the abstract language to emerge.",
		"URL": "http://www.er.ams.eng.osaka-u.ac.jp/icdl-epirob-2013/specialsession-vollmer.html",
		"note": ,
		"author": [
			{
				"family": "Navarro-Guerrero",
				"given": "Nicolás"
			}
		],
		"issued": {
			"year": "2013",
			"month": "18.08.2013",
			"day":"18"
		}
	}
---

