---
tags: [talk, invited talk, research]
categories: talk
author: "Nicolás Navarro-Guerrero"
rights: "Copyright Nicolás Navarro-Guerrero"
license: 

thumbnail: 
file: 
bibtex: 
slides: 
supplementary:
code:

citation: {
		"id": "Navarro-Guerrero2016Neurocomputationala",
		"type": "speech",
		"title": "Neurocomputational Mechanisms for Adaptive Self-Preservative Robot Behaviour",
		"publisher-place": "Valparaíso, Chile",
		"genre": "Invited Talk",
		"event": "Congress on Robotics and Neuroscience (CRONE)",
		"event-place": "Valparaíso, Chile",
		"abstract": "Self-preservative mechanisms belong to the most important and essential capabilities of any organism. Mechanisms such as those involved in homeostatic, defensive, and sexual behaviours are fundamental to ensure individual survival and the perpetuation of the species. However, a simple mapping between stimuli and reactions is not enough to guarantee self-preservation in an ever-changing environment. Consequently, adaptability becomes an essential component for survival. Survival needs and their regulatory processes – although specific to current pressing needs – have system-wide implications, and they impose ground rules for more complex and motivated behaviours. For instance, they modify pain thresholds, shift attentional effort, drive motivation and elicit goal-directed behaviours, thereby establishing the basis for cognitive processes such as planning, decision making, mood and emotions. Focusing particularly on aspects of damage prevention, in this talk I will present my research on neurocomputational self-preservative mechanisms to demonstrate the potential and feasibility of including bio-inspired adaptive self-preservative mechanisms as part of real-world robotic systems.",
		"URL": "http://www.wikicfp.com/cfp/servlet/event.showcfp?eventid=89695",
		"note": ,
		"language": "Spanish",
		"author": [
			{
				"family": "Navarro-Guerrero",
				"given": "Nicolás"
			}
		],
		"issued": {
			"year": "2019",
			"month": "10",
			"day": "27",
		}
	}
---

